In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
data = {'name': ["aaa", "sss","aaa","rrr","ppp"], 
        'phone number': ["919236548973", "9875624134",
                         "768767687","76868767","9876876787"]}
data = pd.DataFrame(data)
print data
print data.name.unique


def isValid(s): 
    Pattern = re.compile("(0/91)?[7-9][0-9]{9}") 
    return Pattern.match(s) 
for i in range(0, 5):
    s= data['phone number'][i]
    if (isValid(s)):  
        print ("Valid Number")      
    else : 
        print ("Invalid Number")

  name  phone number
0  aaa  919236548973
1  sss    9875624134
2  aaa     768767687
3  rrr      76868767
4  ppp    9876876787
<bound method Series.unique of 0    aaa
1    sss
2    aaa
3    rrr
4    ppp
Name: name, dtype: object>
Valid Number
Valid Number
Invalid Number
Invalid Number
Valid Number

In [3]:
data = np.array([['','Col1','Col2'],
                ['name',1,2],
                ['Row2',3,4]])
                
print(pd.DataFrame(data=data[1:,1:],
                  index=data[1:,0],
                  columns=data[0,1:]))

     Col1 Col2
name    1    2
Row2    3    4

In [4]:
df = pd.DataFrame({
                   'height': [94, 170],
                    'age':    [ 3,  29],
                    'weight': [31, 115]})

# print df.dtypes
df2 = pd.DataFrame([[5, 6,40],
                   [7, 8,50],
                   [3,4,59]
                ],columns=['age','height','weight'])
df=df.append(df2,ignore_index=True)
df

   age  height  weight
0    3      94      31
1   29     170     115
2    5       6      40
3    7       8      50
4    3       4      59

In [6]:
df=df[['age','height']]
x=df['age'].min()
x

3

In [5]:
count=0
for number in range(5):
    count = count + number
    print(count)
print("The count is:", count)

0
1
3
6
10
('The count is:', 10)

In [7]:
df.sort_values(["height"], axis=0, ascending=False)

   age  height
1   29     170
0    3      94
3    7       8
2    5       6
4    3       4

In [8]:
df.count()

age       5
height    5
dtype: int64

In [9]:
import re
def isValidEmail(email):
    if len(email) > 7:
        if re.match("^.+@[a-zA-Z0-9]+[.]{1,2}[a-zA-Z0-9]+$", email) != None:
             return True
        return False
if isValidEmail("my.email@gmail.com") == True :
    print("This is a valid email address")
else:
    print("This is not a valid email address")

This is a valid email address

In [10]:
sales = pd.read_csv('sales2009.csv')
sales2 = pd.read_csv('sales2.csv')
sales.shape
sales.iloc[5:15]
sales.city[5:15]
# sales2.loc[5:15, 'city':'round']
pd.merge(sales,sales2,on="city")

,Transaction_date,Product,Price,Payment_Type,Name,city,State,Country,Account_Created,Last_Login,...,Longitude,permalink,company,numEmps,category,state,fundedDate,raisedAmt,raisedCurrency,round
0,1/12/09 1:37,Product1,1200,Visa,IMAN,Brisbane,Queensland,Australia,1/12/09 1:26,1/15/09 17:54,...,153.016667,glammedia,Glam Media,NaN,web,CA,1-Jul-04,1100000,USD,a
1,1/12/09 1:37,Product1,1200,Visa,IMAN,Brisbane,Queensland,Australia,1/12/09 1:26,1/15/09 17:54,...,153.016667,glammedia,Glam Media,NaN,web,CA,1-Jul-05,10000000,USD,b
2,1/12/09 1:37,Product1,1200,Visa,IMAN,Brisbane,Queensland,Australia,1/12/09 1:26,1/15/09 17:54,...,153.016667,glammedia,Glam Media,NaN,web,CA,1-Dec-06,18500000,USD,c
3,1/12/09 1:37,Product1,1200,Visa,IMAN,Brisbane,Queensland,Australia,1/12/09 1:26,1/15/09 17:54,...,153.016667,glammedia,Glam Media,NaN,web,CA,1-Feb-08,65000000,USD,d
4,1/12/09 1:37,Product1,1200,Visa,IMAN,Brisbane,Queensland,Australia,1/12/09 1:26,1/15/09 17:54,...,153.016667,glammedia,Glam Media,NaN,web,CA,1-Feb-08,20000000,USD,d
5,1/23/09 21:35,Product1,1200,Visa,Ann,Brisbane,Queensland,Australia,4/21/07 19:33,2/18/09 23:12,...,153.016667,glammedia,Glam Media,NaN,web,CA,1-Jul-04,1100000,USD,a
6,1/23/09 21:35,Product1,1200,Visa,Ann,Brisbane,Queensland,Australia,4/21/07 19:33,2/18/09 23:12,...,153.016667,glammedia,Glam Media,NaN,web,CA,1-Jul-05,10000000,USD,b
7,1/23/09 21:35,Product1,1200,Visa,Ann,Brisbane,Queensland,Australia,4/21/07 19:33,2/18/09 23:12,...,153.016667,glammedia,Glam Media,NaN,web,CA,1-Dec-06,18500000,USD,c
8,1/23/09 21:35,Product1,1200,Visa,Ann,Brisbane,Queensland,Australia,4/21/07 19:33,2/18/09 23:12,...,153.016667,glammedia,Glam Media,NaN,web,CA,1-Feb-08,65000000,USD,d
9,1/23/09 21:35,Product1,1200,Visa,Ann,Brisbane,Queensland,Australia,4/21/07 19:33,2/18/09 23:12,...,153.016667,glammedia,Glam Media,NaN,web,CA,1-Feb-08,20000000,USD,d
10,1/18/09 10:42,Product1,1200,Visa,malin,Atlanta,Georgia,United States,1/18/09 0:00,1/20/09 11:09,...,-84.388060,vitrue,Vitrue,NaN,web,GA,1-Oct-07,10000000,USD,b
11,1/18/09 10:42,Product1,1200,Visa,malin,Atlanta,Georgia,United States,1/18/09 0:00,1/20/09 11:09,...,-84.388060,vitrue,Vitrue,NaN,web,GA,1-May-06,2200000,USD,seed
12,1/18/09 10:42,Product1,1200,Visa,malin,Atlanta,Georgia,United States,1/18/09 0:00,1/20/09 11:09,...,-84.388060,screamingsports,Screaming Sports,NaN,web,GA,1-Jul-07,1250000,USD,a
13,1/18/09 10:42,Product1,1200,Visa,malin,Atlanta,Georgia,United States,1/18/09 0:00,1/20/09 11:09,...,-84.388060,berecruited,beRecruited,NaN,web,GA,1-Nov-07,1200000,USD,a
14,1/18/09 10:42,Product1,1200,Visa,malin,Atlanta,Georgia,United States,1/18/09 0:00,1/20/09 11:09,...,-84.388060,mfg,MFG,NaN,web,GA,1-Sep-05,14000000,USD,a
15,1/18/09 10:42,Product1,1200,Visa,malin,Atlanta,Georgia,United States,1/18/09 0:00,1/20/09 11:09,...,-84.388060,mfg,MFG,NaN,web,GA,1-Jan-07,4000000,USD,c
16,1/18/09 10:42,Product1,1200,Visa,malin,Atlanta,Georgia,United States,1/18/09 0:00,1/20/09 11:09,...,-84.388060,mfg,MFG,NaN,web,GA,1-Jan-08,26000000,USD,d
17,1/18/09 10:42,Product1,1200,Visa,malin,Atlanta,Georgia,United States,1/18/09 0:00,1/20/09 11:09,...,-84.388060,scintella-solutions,Scintella Solutions,2.0,consulting,GA,30-Apr-08,10000,USD,seed
18,1/16/09 1:51,Product1,1200,Visa,Angela,Vienna,Vienna,Austria,1/16/09 1:38,1/24/09 5:39,...,16.366667,parature,Parature,100.0,software,VA,5-Jul-06,13500000,USD,a
19,1/16/09 1:51,Product1,1200,Visa,Angela,Vienna,Vienna,Austria,1/16/09 1:38,1/24/09 5:39,...,16.366667,parature,Parature,100.0,software,VA,7-May-08,16000000,USD,b
20,1/16/09 1:51,Product1,1200,Visa,Angela,Vienna,Vienna,Austria,1/16/09 1:38,1/24/09 5:39,...,16.366667,appian,Appian,120.0,software,VA,21-Jul-08,10000000,USD,a

In [11]:
data = pd.read_csv("matrix1.csv")
df1=data
print df1
# take values over the column axis. 

#df1.take([0, 1, 2], axis = 0)
df_temp=df1.iloc[:,1:3]
print(df_temp)
x=np.sum(df_temp.values,axis=1)
df_temp['new']=x
print(df_temp)
df_temp.to_csv("../../../file.csv",index=False)

    1   2   3   4
0   3  53  10  65
1  23   4   5   7
2  56   2  22  35
3   0   2  10   0
    2   3
0  53  10
1   4   5
2   2  22
3   2  10
    2   3  new
0  53  10   63
1   4   5    9
2   2  22   24
3   2  10   12

/home/xelpmoc/.local/lib/python2.7/site-packages/ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  # Remove the CWD from sys.path while we load stuff.

In [12]:
import os
os.listdir('../../../')
os.listdir('.')

['matrix2.csv',
 'test.py',
 'matrix1.csv',
 'sales2009.csv',
 '.git',
 'Untitled.ipynb',
 'python1.ipynb',
 'sales2.csv',
 '.ipynb_checkpoints']

In [9]:
df1 = {
    'State':['Arizona','Georgia','Newyork','Indiana','Florida'],
    'State_code':['AZ','GG','NY','IN','SL'],
   'Score':[62,47,55,74,31]}
 
df1 = pd.DataFrame(df1,columns=['State','State_code','Score'])
print(df1)
df1.iloc[0,1:3]

     State State_code  Score
0  Arizona         AZ     62
1  Georgia         GG     47
2  Newyork         NY     55
3  Indiana         IN     74
4  Florida         SL     31

State_code    AZ
Score         62
Name: 0, dtype: object

In [10]:
attr1= 'State'
attr2='Score'
df1['new']= df1[attr1]+''+df1[attr2].apply(str)
df1

     State State_code  Score        new
0  Arizona         AZ     62  Arizona62
1  Georgia         GG     47  Georgia47
2  Newyork         NY     55  Newyork55
3  Indiana         IN     74  Indiana74
4  Florida         SL     31  Florida31

In [25]:
inputval = input("1 for concatenation \n 2 for Summation")
inputval
print df1
if inputval==1:
    print "concat"
    print "Name the Attributes u want to concate"
    attr1 = input("1st attribute")
    attr2 = input("Name the 2nd attribute")
    print attr1
    df1['New_concated'] = df1[attr1].apply(str) +' '+ df1[attr2].apply(str)
    print(df1)

elif inputval==2:
    flag = True
    print "sum"
    num=input("How many columns to sum")
    for x in range(0,num):
        if not np.issubdtype(df1.iloc[:,x].dtype, np.number):
            flag = False
            break
    if flag:print(df1[:,:num].sum(axis=1))
    else:print "Summation cant be done as the cells contain non-integer values"
else:
    print "invalid"
    df1.to_csv('/home/xelpmoc/Desktop/Python/df1.csv', index=False)

1 for concatenation
 2 for Summation1
     State State_code  Score New_concated        new
0  Arizona         AZ     62   Arizona AZ  Arizona62
1  Georgia         GG     47   Georgia GG  Georgia47
2  Newyork         NY     55   Newyork NY  Newyork55
3  Indiana         IN     74   Indiana IN  Indiana74
4  Florida         SL     31   Florida SL  Florida31
concat
Name the Attributes u want to concate
1st attribute'Score'
Name the 2nd attribute'new'
Score
     State State_code  Score  New_concated        new
0  Arizona         AZ     62  62 Arizona62  Arizona62
1  Georgia         GG     47  47 Georgia47  Georgia47
2  Newyork         NY     55  55 Newyork55  Newyork55
3  Indiana         IN     74  74 Indiana74  Indiana74
4  Florida         SL     31  31 Florida31  Florida31

In [24]:
print df1
df1['State'] == 'Arizona'
fil = df1[(df1['Score'] > 50) & (df1['Score'] < 73) ]
fil

     State State_code  Score        new
0  Arizona         AZ     62  Arizona62
1  Georgia         GG     47  Georgia47
2  Newyork         NY     55  Newyork55
3  Indiana         IN     74  Indiana74
4  Florida         SL     31  Florida31

     State State_code  Score        new
0  Arizona         AZ     62  Arizona62
2  Newyork         NY     55  Newyork55

In [66]:
data = pd.read_csv("matrix2.csv")
df2=data
df2
df_temp=df2['3']
df_tmp=df2[['3','4']]
print(df_tmp.values)
y=np.sum(df_tmp.values,axis=1)
# df2['5']=x
# df2

[[ 7  8]
 [ 2  3]
 [33 44]
 [ 9  8]]

1    int64
2    int64
3    int64
4    int64
5    int64
dtype: object

In [56]:
df1.values + df2.values

array([[ 8, 59, 17, 73],
       [32,  5,  7, 10],
       [67, 24, 55, 79],
       [ 9,  2, 19,  8]])

In [18]:
df = pd.DataFrame({'name': ['Raphael', 'Donatello'],
                    'mask': ['red', 'purple'],
                    'weapon': ['sai', 'bo staff']})
df.to_csv(index=False)

'mask,name,weapon\nred,Raphael,sai\npurple,Donatello,bo staff\n'

In [76]:
s1 = pd.Series(['one', 'one1', '1', ''])
s1.dtype
# Dictionary
x={'a':1,'b':2,'c':3}
x['b']

2

In [84]:
# Python code to test that 
# tuples are immutable 
	
tuple1 = (0, 1, 2, 3) 
tuple1[0] = "5"
print(tuple1)

TypeError: 'tuple' object does not support item assignment

In [53]:
# input two matrices of size n x m 
matrix1 = [[12,7,3], 
		[4 ,5,6], 
		[7 ,8,9]] 
matrix2 = [[5,8,1], 
		[6,7,3], 
		[4,5,9]] 

res = [[0 for x in range(3)] for y in range(3)] 

# explicit for loops 
for i in range(len(matrix1)): 
	for j in range(len(matrix2[0])): 
		for k in range(len(matrix2)): 

			# resulted matrix 
			res[i][j] += matrix1[i][k] * matrix2[k][j] 

print (res)

[[114, 160, 60], [74, 97, 73], [119, 157, 112]]

In [91]:
a=5
print(a +'\n')

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [57]:
[[0 for x in range(3)] for y in range(4)]

[[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]]

In [55]:
res = [[0 for x in range(3)] for y in range(3)] 
res

[[0, 0, 0], [0, 0, 0], [0, 0, 0]]

In [69]:
if np.issubdtype(df2['3'].dtype, np.number) and np.issubdtype(df2['2'].dtype, np.number):
    print('123')

123

In [62]:
mul=np.dot(matrix1,matrix2)
mul

array([[114, 160,  60],
       [ 74,  97,  73],
       [119, 157, 112]])

In [29]:
csv=pd.read_csv('matrix1.csv')
csv2=pd.read_csv('matrix2.csv'
csv=np.matrix
nba["College"].fillna("No College", inplace = True)

    1   2     3     4
0   3  53  10.0  65.0
1  23   4   5.0   NaN
2  56   2   NaN  35.0
3   0   2  10.0   0.0

In [35]:
csv.fillna("100",inplace=False)
csv

    1   2    3    4
0   3  53   10   65
1  23   4    5  100
2  56   2  100   35
3   0   2   10    0

In [80]:
    students = [ ('jack', 'Apples' , 34) ,
                 ('Riti', 'Mangos'  , 31) ,
                 ('Aadi', 'Grapes' , 30) ,
                 ('Sonia', 'Apples', 32) ,
                 ('Lucy', 'Mangos'  , 33) ,
                 ('Mike', 'Apples' , 35)
                  ]
    
    
    #Create a DataFrame object
    dfObj = pd.DataFrame(students, columns = ['Name' , 'Product', 'Sale']) 
    
    print("Original Dataframe" , dfObj, end="\n")
    
    '''
    Select Rows based on value in a column
    '''
    subsetDataFrame = dfObj[dfObj['Product'] == 'Apples']
    
    print("DataFrame with Product : Apples" , subsetDataFrame, sep ='\n')
    
    filteringSeries = dfObj['Product'] == 'Apples'
    print("Filtering Series" , filteringSeries, sep='\n')
    
    subsetDataFrame = dfObj[filteringSeries]
    
    print("DataFrame with Product : Apples" , subsetDataFrame, sep='\n')
    
    '''
    Select Rows based on any of the multiple values in a column
    '''
    subsetDataFrame = dfObj[dfObj['Product'].isin(['Mangos', 'Grapes']) ]
    
    print("DataFrame with Product : Mangos or Grapes" , subsetDataFrame, sep='\n')
 
    '''
    Select DataFrame Rows Based on multiple conditions on columns
    '''
        
    filterinfDataframe = dfObj[(dfObj['Sale'] > 30) & (dfObj['Sale'] < 33) ]
    
    print("DataFrame with Sales between 31 to 32" , filterinfDataframe, sep='\n')

SyntaxError: invalid syntax (<ipython-input-80-9bcf5e927394>, line 13)

In [60]:
print('dfgdg',sep="")

SyntaxError: invalid syntax (<ipython-input-60-2c08e5743ef9>, line 1)